tap "oven-sh/bun"
tap "pomdtr/tap"
tap "pulumi/tap"
tap "supabase/tap"
tap "tinted-theming/tinted"

# Cross-platform packages
brew "age"
brew "bat"
brew "biome"
brew "bun"
brew "ca-certificates"
brew "cairo"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "duckdb"
brew "emscripten"
brew "fd"
brew "fossil"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "glib"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "gtop"
brew "harfbuzz"
brew "htop"
brew "ideviceinstaller"
brew "imagemagick"
brew "jc"
brew "jless"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libimobiledevice"
brew "libpq"
brew "llvm"
brew "luarocks"
brew "mkcert"
brew "monolith"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "node"
brew "nss"
brew "opencode"
brew "openssl@3"
brew "pgloader"
brew "pnpm"
brew "postgresql@15"
brew "pulumi"
brew "py3cairo"
brew "pygobject3"
brew "python@3.11"
brew "qemu"
brew "ripgrep"
brew "shared-mime-info"
brew "socat"
brew "sq"
brew "starship"
brew "sunbeam"
brew "supabase"
brew "tinty"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "trivy"
brew "ttyd"
brew "unzip"
brew "watch"
brew "wget"
brew "zoxide"
brew "zsh"
# macOS-only packages
if OS.mac?
  tap "koekeishiya/formulae"
  tap "nikitabobko/tap"
  tap "trycua/lume"

  brew "cocoapods"
  brew "displayplacer"
  brew "koekeishiya/formulae/skhd", args: ["HEAD"]
  brew "koekeishiya/formulae/yabai"
  brew "libiconv"
  brew "trycua/lume/lume"
end
