tap "pomdtr/tap"
tap "pulumi/tap"
tap "tinted-theming/tinted"

# Cross-platform packages
brew "age"
brew "bat"
brew "ca-certificates"
brew "cairo"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "duckdb"
brew "emscripten"
brew "fd"
brew "fossil"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "glib"
brew "gnutls"
brew "gobject-introspection"
brew "gtop"
brew "harfbuzz"
brew "htop"
brew "ideviceinstaller"
brew "imagemagick"
brew "jc"
brew "jless"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libimobiledevice"
brew "libpq"
brew "llvm"
brew "luarocks"
brew "mkcert"
brew "monolith"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "node"
brew "nss"
brew "opencode"
brew "openssl@3"
brew "pgloader"
brew "pomdtr/tap/sunbeam"
brew "postgresql@15"
brew "py3cairo"
brew "pygobject3"
brew "python@3.11"
brew "qemu"
brew "ripgrep"
brew "shared-mime-info"
brew "socat"
brew "sq"
brew "starship"
brew "the_silver_searcher"
brew "tinted-theming/tinted/tinty"
brew "tmux"
brew "tree"
brew "trivy"
brew "ttyd"
brew "unzip"
brew "watch"
brew "wget"
brew "zoxide"
brew "zsh"
brew "tree-sitter-cli"
tap "psviderski/tap"
brew "btop"
brew "dust"
brew "helix"
brew "himalaya"
brew "openai-whisper"
brew "poppler"
tap "antoniorodr/memo"
tap "marcus/tap"
tap "steipete/tap"
tap "yakitrak/yakitrak"
brew "difi"
# macOS-only packages
if OS.mac?
  tap "koekeishiya/formulae"
  tap "nikitabobko/tap"
  tap "trycua/lume"

  brew "cocoapods"
  brew "displayplacer"
  brew "koekeishiya/formulae/skhd", args: ["HEAD"]
  brew "koekeishiya/formulae/yabai"
  brew "libiconv"
  brew "trycua/lume/lume"
  brew "mole"
  brew "tree-sitter"
  brew "psviderski/tap/uncloud"
  brew "antoniorodr/memo/memo"
  brew "marcus/tap/sidecar"
  brew "marcus/tap/td"
  brew "rclone"
  brew "rustup"
  brew "steipete/tap/gifgrep"
  brew "steipete/tap/gogcli"
  brew "steipete/tap/imsg"
  brew "steipete/tap/peekaboo"
  brew "steipete/tap/remindctl"
  brew "steipete/tap/summarize"
  brew "steipete/tap/wacli"
  brew "yakitrak/yakitrak/obsidian-cli"
end
