tap "coder/coder"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pomdtr/tap"
tap "pulumi/tap"
tap "supabase/tap"
tap "tinted-theming/tinted"
tap "trycua/lume"
# Simple, modern, secure file encryption
brew "age"
# Mozilla CA certificate store
brew "ca-certificates"
# GNU compiler collection
brew "gcc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# AI pair programming in your terminal
brew "aider"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# OpenType text shaping engine
brew "harfbuzz"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Distributed software configuration management
brew "fossil"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# System monitoring dashboard for terminal
brew "gtop"
# Improved top (interactive process viewer)
brew "htop"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI client for interacting with Incus
brew "incus"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# Next-gen compiler infrastructure
brew "llvm"
# Package manager for the Lua programming language
brew "luarocks"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Modern shell for the GitHub era
brew "nushell"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Data loading tool for PostgreSQL
brew "pgloader"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# SOcket CAT: netcat on steroids
brew "socat"
# Data wrangler with jq-like query language
brew "sq"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Provisions remote development environments via Terraform
brew "coder/coder/coder"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd", args: ["HEAD"]
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
brew "pomdtr/tap/sunbeam"
# Change the theme of your terminal, text editor and anything else with one command.
brew "tinted-theming/tinted/tinty"
# CLI and local API server to run macOS and Linux VMs on Apple Silicon
brew "trycua/lume/lume"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "codingwell-net.codingwell-vscode-jscad"
vscode "compulim.vscode-ipaddress"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.arb-editor"
vscode "hverlin.mise-vscode"
vscode "jetify.devbox"
vscode "jetpack-io.devbox"
vscode "jnoortheen.nix-ide"
vscode "koog1000.fossil"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "moalamri.inline-fold"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-server"
vscode "nilpatel.title"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "sleistner.vscode-fileutils"
vscode "supabase.postgrestools"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tintedtheming.base16-tinted-themes"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "waderyan.gitblame"
